Revit 2027 API
WallSweepInfo.IsProfileFlipped Property
 Indicates if the profile is applied upside-down.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool IsProfileFlipped { get; set; }
Public Property IsProfileFlipped As Boolean
	Get
	Set
public:
property bool IsProfileFlipped {
	bool get ();
	void set (bool value);
}
member IsProfileFlipped : bool with get, set
Property Value
Boolean
 True if the profile is applied upside-down, false otherwise.
See Also
Reference
WallSweepInfo Class
Autodesk.Revit.DB Namespace